// Javascript - это язык управления сценариями на веб-странице.
// События - действия, которые происхдят в момент взаимодействия с каким-либо элементом на
// web-странице браузера.

// События
// События мыши:
// - click - клик на левую кнопку мыши;
// - contextmenu - клик на правую кнопку мыши;
// - mouseover - когда мышь наводится на элемент;
// - ondblclick - двойной клик мыши;

// События клавиатуры:
// - onkeypress (keydown) - когда нажимаем на кнопку;
// - onkeyup - когда отпускаем кнопку;

// События форм и элементов:
// - onfocus - когда элемент в фокусе;
// - onblur - когда элемент теряет фокус;
// - onsubmit - когда отправляем форму.
window.onload = function() {
    alert("Страница загружена")
}

