// DOM - объектная модель документа, которая формируется браузером
// перед тем, как вывести страницу на экран.
// CSSOM - построение объектной модел CSS
// Построение модели визуализации - DOM + CSSOM
// Рендеринг - отрисовка макета страницы

// DOM-события
// 1. DOMContentLoaded - срабатывает сразу после того, как браузер полностью загрузил
// HTML и построил DOM-дерево.
// 2. window.onload - рабатывает только после того, как загрузится вся страница,
// включая все ресурсы в ней.
// - script с атрибутом defer будет выполнен сразу после построения DOM, прямо перед вызовом события DOMContentLoaded;
// - script с атрибутом async будет выполнен в тот же момент, как только загрузится.
// Это может произойти до того, как браузер успеет построить DOM.



